tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/machine_pdm_pcm.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdlib.h>
#include <string.h>

#include "py/runtime.h"
#include "py/stream.h"
#include "py/mphal.h"
#include "py/ringbuf.h"
#include "modmachine.h"
#include "mphalport.h"
#include "mplogger.h"
#include "cycfg_pins.h"

#if MICROPY_PY_MACHINE_PDM_PCM
#include "machine_pdm_pcm.h"
#include "cy_sysclk.h"

#if MICROPY_PY_MACHINE_PDM_PCM_RING_BUF

static uint8_t channel_index = RIGHT_CH_INDEX;

static cy_stc_pdm_pcm_channel_config_t channel_config = {
    /* sampledelay is where on the clock cycle the data line is sampled. This
     * said 1; the Eva Kit's own BSP says 5 for this same channel on this same
     * board (cycfg_peripherals.c, channel_3_config), and CM55's Edge AI audio
     * models get real speech out of it. Every other field in this struct
     * already matches that BSP entry exactly -- this was the only one that
     * did not, and sampling every bit at the wrong instant turns a PDM stream
     * into full-scale hash, which is what the microphone produced. */
    .sampledelay = 5,
    .wordSize = CY_PDM_PCM_WSIZE_16_BIT,
    .signExtension = true,
    .rxFifoTriggerLevel = 31,
    .fir0_enable = false,
    .cic_decim_code = CY_PDM_PCM_CHAN_CIC_DECIM_32,
    .fir0_decim_code = CY_PDM_PCM_CHAN_FIR0_DECIM_1,
    .fir0_scale = 0,
    .fir1_decim_code = CY_PDM_PCM_CHAN_FIR1_DECIM_3,
    .fir1_scale = 10,
    .dc_block_disable = false,
    .dc_block_code = CY_PDM_PCM_CHAN_DCBLOCK_CODE_16,
};


/* Blocking reads used to spin on ringbuf_get() forever. If the PDM block is
 * not actually clocking — which is what happens on a board whose audio codec
 * already owns the clock tree, e.g. the Eva Kit with BSP_HAS_AUDIO_CODEC — the
 * ring buffer never fills and readinto() never returns. Measured on hardware
 * 2026-08-13: the constructor succeeded, readinto() hung, and the CPU sat in
 * thread mode (IPSR 0) waiting on a buffer nothing was filling. Only a debugger
 * reset recovered it, and a hang is not catchable with try/except.
 *
 * A bounded wait turns that into an OSError the caller can handle and report.
 * The timeout is generous: at 16 kHz mono 16-bit, 512 samples is 32 ms, so a
 * healthy stream is never near this limit. */
#define PDM_PCM_READ_TIMEOUT_MS  (2000u)

static uint32_t fill_appbuf_from_ringbuf(machine_pdm_pcm_obj_t *self, mp_buffer_info_t *appbuf) {
    uint32_t t_start = mp_hal_ticks_ms();
    uint32_t num_bytes_copied_to_appbuf = 0;
    uint8_t *app_p = (uint8_t *)appbuf->buf;
    uint8_t appbuf_sample_size_in_bytes = (self->bits == 16? 2 : 3) * (self->format == STEREO ? 2: 1);
    /* Mono 16-bit: the ring already holds exactly what the caller wants.
     *
     * The frame walk below is inherited from an I2S driver, where the hardware
     * hands over 8-byte stereo frames and the map says which bytes to keep.
     * This PDM ISR does not do that -- it writes packed int16 samples straight
     * into the buffer it copies to the ring. So for mono the map kept 2 bytes
     * and threw away 6, which is every fourth sample: a 16 kHz stream arriving
     * as 4 kHz, with everything above 2 kHz folded back on top of it. Measured
     * on an Eva Kit 2026-08-14, that is what turned a quiet room into
     * full-scale hash and sent three separate investigations after the clock,
     * the channel and the sample delay -- all of which were already correct,
     * as a register dump against CM55's working path finally showed.
     *
     * Straight copy, no map, no discard. */
    if (self->format != STEREO && self->bits == 16) {
        while (num_bytes_copied_to_appbuf < appbuf->len) {
            int data;
            while ((data = ringbuf_get(&self->ring_buffer)) == -1) {
                if (mp_hal_ticks_ms() - t_start > PDM_PCM_READ_TIMEOUT_MS) {
                    mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT(
                        "PDM_PCM: no samples arrived. The block is configured "
                        "but nothing is reaching the FIFO."));
                }
            }
            app_p[num_bytes_copied_to_appbuf] = (uint8_t)data;
            num_bytes_copied_to_appbuf++;
        }
        return num_bytes_copied_to_appbuf;
    }

    uint32_t num_bytes_needed_from_ringbuf = appbuf->len * (PDM_PCM_RX_FRAME_SIZE_IN_BYTES / appbuf_sample_size_in_bytes);
    while (num_bytes_needed_from_ringbuf) {

        uint8_t f_index = get_frame_mapping_index(self->bits, self->format);

        for (uint8_t i = 0; i < PDM_PCM_RX_FRAME_SIZE_IN_BYTES; i++) {
            int8_t r_to_a_mapping = pdm_pcm_frame_map[f_index][i];
            if (r_to_a_mapping != -1) {
                if (self->io_mode == BLOCKING) {
                    int data;
                    while ((data = ringbuf_get(&self->ring_buffer)) == -1) {
                        if (mp_hal_ticks_ms() - t_start > PDM_PCM_READ_TIMEOUT_MS) {
                            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT(
                                "PDM_PCM: no samples arrived. On boards whose "
                                "audio codec owns the clock tree the PDM block "
                                "may never start."));
                        }
                    }
                    app_p[r_to_a_mapping] = (uint8_t)data;
                    num_bytes_copied_to_appbuf++;
                } else {
                    return 0;  // should never get here (non-blocking mode does not use this function)
                }
            } else { // r_a_mapping == -1
                // discard unused byte from ring buffer
                if (self->io_mode == BLOCKING) {
                    // poll the ringbuf until a sample becomes available
                    while (ringbuf_get(&self->ring_buffer) == -1) {
                        if (mp_hal_ticks_ms() - t_start > PDM_PCM_READ_TIMEOUT_MS) {
                            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT(
                                "PDM_PCM: no samples arrived (discard path)."));
                        }
                    }
                } else {
                    return 0;  // should never get here (non-blocking mode does not use this function)
                }
            }
            num_bytes_needed_from_ringbuf--;
        }
        app_p += appbuf_sample_size_in_bytes;
    }
    return num_bytes_copied_to_appbuf;
}

