tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/machine_pdm_pcm.c
// Copy from ringbuf to appbuf as soon as ASYNC_TRANSFER_COMPLETE is triggered
static void fill_appbuf_from_ringbuf_non_blocking(machine_pdm_pcm_obj_t *self) {
    uint32_t num_bytes_copied_to_appbuf = 0;
    uint8_t *app_p = &(((uint8_t *)self->non_blocking_descriptor.appbuf.buf)[self->non_blocking_descriptor.index]);

    uint8_t appbuf_sample_size_in_bytes = (self->bits == 16? 2 : 3) * (self->format == STEREO ? 2: 1);
    uint32_t num_bytes_remaining_to_copy_to_appbuf = self->non_blocking_descriptor.appbuf.len - self->non_blocking_descriptor.index;
    uint32_t num_bytes_remaining_to_copy_from_ring_buffer = num_bytes_remaining_to_copy_to_appbuf *
        (PDM_PCM_RX_FRAME_SIZE_IN_BYTES / appbuf_sample_size_in_bytes);
    uint32_t num_bytes_needed_from_ringbuf = MIN(SIZEOF_NON_BLOCKING_COPY_IN_BYTES, num_bytes_remaining_to_copy_from_ring_buffer);
    if (ringbuf_avail(&self->ring_buffer) >= num_bytes_needed_from_ringbuf) {
        while (num_bytes_needed_from_ringbuf) {

            uint8_t f_index = get_frame_mapping_index(self->bits, self->format);

            for (uint8_t i = 0; i < PDM_PCM_RX_FRAME_SIZE_IN_BYTES; i++) {
                int8_t r_to_a_mapping = pdm_pcm_frame_map[f_index][i];
                if (r_to_a_mapping != -1) {
                    int data = ringbuf_get(&self->ring_buffer);
                    if (data != -1) {
                        app_p[r_to_a_mapping] = (uint8_t)data;
                        num_bytes_copied_to_appbuf++;
                    }
                } else { // r_a_mapping == -1
                    // discard unused byte from ring buffer
                    ringbuf_get(&self->ring_buffer);
                }
                num_bytes_needed_from_ringbuf--;
            }
            app_p += appbuf_sample_size_in_bytes;
        }
        self->non_blocking_descriptor.index += num_bytes_copied_to_appbuf;

        if (self->non_blocking_descriptor.index >= self->non_blocking_descriptor.appbuf.len) {
            self->non_blocking_descriptor.copy_in_progress = false;
            mp_sched_schedule(self->callback_for_non_blocking, MP_OBJ_FROM_PTR(self));
        }
    }
}
#endif // MICROPY_PY_MACHINE_PDM_PCM_RING_BUF

/*========================================================================================================================*/
// PDM_PCM higher level MPY functions (extmod/machine_pdm_pcm.c)

static void machine_pdm_pcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print,
        "PDM_PCM(id=%u,\n"
        "sample_rate=%ld,\n"
        "decimation_rate=%d,\n"
        "bits=%u,\n"
        "format=%u,\n"
        "left_gain=%d,\n"
        "right_gain=%d)",
        self->pdm_pcm_id,
        self->sample_rate,
        self->decimation_rate,
        self->bits,
        self->format,
        self->left_gain,
        self->right_gain
        );
}

// PDM_PCM.init(...)
static mp_obj_t machine_pdm_pcm_init(mp_obj_t self_in) {
    mplogger_print("machine_pdm_pcm_init \r\n");
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_machine_pdm_pcm_init(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_init_obj, machine_pdm_pcm_init);

// PDM_PCM.deinit()
static mp_obj_t machine_pdm_pcm_deinit(mp_obj_t self_in) {
    mplogger_print("machine_pdm_pcm_deinit \r\n");
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_machine_pdm_pcm_deinit(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_deinit_obj, machine_pdm_pcm_deinit);

// PDM_PCM.set_gain()
static mp_obj_t machine_pdm_pcm_set_gain(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mplogger_print("machine_pdm_pcm_set_gain \r\n");

    enum { ARG_left_gain, ARG_right_gain};
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_left_gain,       MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_LEFT_GAIN} },
        { MP_QSTR_right_gain,      MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_RIGHT_GAIN} }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);

    int16_t left_gain = args[ARG_left_gain].u_int;
    int16_t right_gain = args[ARG_right_gain].u_int;

    int16_t prev_left_gain = self->left_gain;
    int16_t prev_right_gain = self->right_gain;

    self->left_gain = (left_gain == prev_left_gain) ? prev_left_gain : left_gain;
    self->right_gain = (right_gain == prev_right_gain) ? prev_right_gain : right_gain;

    mp_machine_pdm_pcm_set_gain(self, left_gain, right_gain);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_pdm_pcm_set_gain_obj, 1, machine_pdm_pcm_set_gain);

// PDM_PCM.irq(handler)
static mp_obj_t machine_pdm_pcm_irq(mp_obj_t self_in, mp_obj_t handler) {
    mplogger_print("machine_pdm_pcm_irq \r\n");
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (handler != mp_const_none && !mp_obj_is_callable(handler)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid callback"));
    }

    if (handler != mp_const_none) {
        self->io_mode = NON_BLOCKING;
    } else {
        self->io_mode = BLOCKING;
    }

    self->callback_for_non_blocking = handler;

    mp_machine_pdm_pcm_irq_update(self);

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(machine_pdm_pcm_irq_obj, machine_pdm_pcm_irq);


cy_en_pdm_pcm_ch_fir1_decimcode_t pdm_pcm_convert_decim_rate(uint8_t decim_rate) {
    cy_en_pdm_pcm_ch_fir1_decimcode_t pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_1;

    switch (decim_rate)
    {
        case 32:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_1;
            break;
        case 64:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_2;
            break;
        case 96:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_3;
            break;
        case 128:
            pdl_code = CY_PDM_PCM_CHAN_FIR1_DECIM_4;
            break;
        default:
            break;
    }

    return pdl_code;
}

// Helper: Configure PDM PCM interrupts
static void pdm_pcm_configure_interrupts(machine_pdm_pcm_obj_t *self) {
    mplogger_print("pdm_pcm_configure_interrupts \r\n");

    /* As interrupt is registered for right channel, clear and set masks for it. */
    Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, channel_index, CY_PDM_PCM_INTR_MASK);
    Cy_PDM_PCM_Channel_SetInterruptMask(PDM0, channel_index, CY_PDM_PCM_INTR_MASK);
}

// Helper: Configure DPLL for audio clock generation
static cy_rslt_t dpll_lp_configure(uint32_t target_freq) {
    mplogger_print("dpll_lp_configure \r\n");
    cy_rslt_t result;

    /* Check if the current DPLL_LP_1 frequency is already set to target */
    uint32_t current_freq = Cy_SysClk_PllGetFrequency(SRSS_DPLL_LP_1_PATH_NUM);
    if (current_freq == target_freq) {
        mplogger_print("DPLL_LP_1 already at target frequency\r\n");
        return CY_RSLT_SUCCESS;
    }

    /* Configure DPLL_LP_1 PLL */
    cy_stc_pll_config_t dpll_config = {
        .inputFreq = DPLL_INPUT_FREQ_HZ,
        .outputFreq = target_freq,
        .outputMode = CY_SYSCLK_FLLPLL_OUTPUT_AUTO,
        .lfMode = false,
    };

    /* Disable the DPLL_LP_1 PLL path */
    Cy_SysClk_PllDisable(SRSS_DPLL_LP_1_PATH_NUM);

    /* Configure the PLL with the specified settings */
    result = Cy_SysClk_PllConfigure(SRSS_DPLL_LP_1_PATH_NUM, &dpll_config);
    if (result != CY_SYSCLK_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("DPLL LP1 configuration failed with return code %lx"),
            result);
    }

    /* Enable the DPLL_LP_1 PLL path with a timeout */
    result = Cy_SysClk_PllEnable(SRSS_DPLL_LP_1_PATH_NUM, DPLL_ENABLE_TIMEOUT_MS);
    if (result != CY_SYSCLK_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("DPLL LP1 enable failed with return code %lx"),
            result);
    }

    return CY_RSLT_SUCCESS;
}

