tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/machine_pdm_pcm.c
// Helper: Determine appropriate DPLL frequency for sample rate
static uint32_t pdm_pcm_get_dpll_freq(uint32_t sample_rate) {
    mplogger_print("pdm_pcm_get_dpll_freq \r\n");
    switch (sample_rate) {
        case SAMPLE_RATE_8000:
        case SAMPLE_RATE_16000:
        case SAMPLE_RATE_48000:
            return DPLL_OUTPUT1_FREQ_HZ;

        case SAMPLE_RATE_22050:
        case SAMPLE_RATE_44100:
            return DPLL_OUTPUT2_FREQ_HZ;

        default:
            return 0;  // Invalid sample rate
    }
}

// Helper: Calculate optimal clock divider with rounding
static uint16_t pdm_pcm_calculate_clk_div(uint32_t dpll_freq, uint32_t sample_rate, uint8_t decimation_rate) {
    mplogger_print("pdm_pcm_calculate_clk_div \r\n");
    uint32_t required_clk = sample_rate * decimation_rate * PDM_PCM_CLK_OVERSAMPLING_FACTOR;

    /* Calculate divider with rounding for better accuracy */
    uint16_t clk_div = (dpll_freq + (required_clk / 2)) / required_clk;

    /* Ensure divider is at least 1 */
    return (clk_div > 0) ? clk_div : 1;
}

// Helper: Configure peripheral clock divider
static void pdm_pcm_configure_clock_divider(uint16_t clk_div) {
    mplogger_print("pdm_pcm_configure_clock_divider \r\n");
    /* Disable the clock divider before reconfiguration */
    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM,
        CY_SYSCLK_DIV_16_5_BIT, 1U);

    /* Set the fractional divider. The PDL takes N-1: the register divides by
     * one more than the value written.
     *
     * This passed the divide ratio itself, so a computed 6 divided by 7 and the
     * PDM ran at 73.728/7 = 10.53 MHz instead of the 12.288 MHz that 16 kHz x
     * 96 x 8 asks for -- 17% slow. The block started and delivered samples, and
     * every one of them was full-scale hash: measured on an Eva Kit 2026-08-14,
     * lo -32768, hi 32767, AC 23084, consecutive samples leaping the whole
     * range. That is a bitstream decoded at the wrong rate, not sound.
     *
     * The board's own BSP is the proof of the convention: it writes 3 for this
     * same divider (cycfg_peripheral_clocks.c), which is divide-by-4, and
     * 49.152/4 is exactly 12.288 MHz. CM55's Edge AI audio models have always
     * run on that setting. */
    Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM,
        CY_SYSCLK_DIV_16_5_BIT, 1U, (clk_div > 0U) ? (clk_div - 1U) : 0U, 0U);

    /* Enable the configured clock divider */
    Cy_SysClk_PeriPclkEnableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM,
        CY_SYSCLK_DIV_16_5_BIT, 1U);
}

// Initialize PDM PCM sample rate and clock configuration
static PDM_PCM_STATUS_t pdm_pcm_init_sample_rate(uint32_t sample_rate, uint8_t decimation_rate) {
    mplogger_print("pdm_pcm_init_sample_rate \r\n");
    /* Determine the appropriate DPLL frequency for the sample rate */
    uint32_t dpll_freq = pdm_pcm_get_dpll_freq(sample_rate);
    if (dpll_freq == 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("Unsupported sample rate"));
        return PDM_PCM_STATUS_BAD_PARAM;
    }

    /* Leave the board's own clock alone when it already delivers this rate.
     *
     * The BSP programs this exact divider to 3 -- divide by 4 -- against a
     * 49.152 MHz DPLL_LP_1, which is 12.288 MHz, exactly 16000 x 96 x 8. CM55
     * runs its Edge AI audio models on that and gets speech out of it. This
     * code instead retuned DPLL_LP_1 to 73.728 MHz and recomputed a divider,
     * arriving at the same 12.288 MHz by a different route -- while dragging
     * the audio codec's MCLK, which derives from the same PLL, along with it.
     *
     * Two paths to one number, one of them proven on this board and one of
     * them not. Take the proven one for the configuration the BSP was built
     * for, and only reprogram the clock when the script asks for something
     * else. */
    if (sample_rate == 16000u && decimation_rate == 96u) {
        mplogger_print("PDM PCM: keeping the BSP clock (12.288 MHz)\r\n");
        return PDM_PCM_STATUS_SUCCESS;
    }

    /* Configure DPLL to the required frequency */
    dpll_lp_configure(dpll_freq);

    /* Calculate optimal clock divider */
    uint16_t clk_div = pdm_pcm_calculate_clk_div(dpll_freq, sample_rate, decimation_rate);

    /* Configure the peripheral clock divider */
    pdm_pcm_configure_clock_divider(clk_div);

    mplogger_print("PDM PCM clock configured: DPLL=%lu Hz, div=%u\r\n", dpll_freq, clk_div);

    return PDM_PCM_STATUS_SUCCESS;
}

// Init hardware block
static void pdm_pcm_init(machine_pdm_pcm_obj_t *self) {
    cy_rslt_t result;
    mplogger_print("pdm_pcm_init \r\n");

    // Configure PDM PCM block
    cy_stc_pdm_pcm_config_v2_t PDM_config = {
        .clkDiv = 7,
        .clksel = CY_PDM_PCM_SEL_SRSS_CLOCK,
        .halverate = CY_PDM_PCM_RATE_FULL,
        .route = 4,
        .fir0_coeff_user_value = false,
        .fir1_coeff_user_value = false,
    };

    // Initialize PDM PCM block
    result = Cy_PDM_PCM_Init(PDM0, &PDM_config);
    pdm_pcm_assert_raise_val("PDM_PCM initialisation failed with return code %lx !", result);
    pdm_pcm_init_sample_rate(self->sample_rate, self->decimation_rate);
    // Initialize left channel if needed
    if ((self->format == MONO_LEFT) || (self->format == STEREO)) {
        channel_index = LEFT_CH_INDEX;
        Cy_PDM_PCM_Channel_Enable(PDM0, channel_index);
        channel_config.sampledelay = 1;
        result = Cy_PDM_PCM_Channel_Init(PDM0, &channel_config, channel_index);
        pdm_pcm_assert_raise_val("PDM_PCM left channel init failed with return code %lx !", result);
        result = Cy_PDM_PCM_SetGain(PDM0, channel_index, self->left_gain);
        pdm_pcm_assert_raise_val("PDM_PCM set left channel gain failed with return code %lx !", result);
    }

    // Initialize right channel if needed
    if ((self->format == MONO_RIGHT) || (self->format == STEREO)) {
        channel_index = RIGHT_CH_INDEX; // if stereo mode, right channel gets interrupt
        Cy_PDM_PCM_Channel_Enable(PDM0, channel_index);
        channel_config.sampledelay = 5;
        result = Cy_PDM_PCM_Channel_Init(PDM0, &channel_config, channel_index);
        pdm_pcm_assert_raise_val("PDM_PCM right channel init failed with return code %lx !", result);
        result = Cy_PDM_PCM_SetGain(PDM0, channel_index, self->right_gain);
        pdm_pcm_assert_raise_val("PDM_PCM set right channel gain failed with return code %lx !", result);
    }

    // Determine IRQ number based on which channel is used for interrupts
    self->irq_num = (IRQn_Type)(pdm_0_interrupts_0_IRQn + channel_index);

    // Configure interrupts
    pdm_pcm_configure_interrupts(self);

    self->pdm_pcm_initialized = true;
}

int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if ((format == MONO_LEFT) | (format == MONO_RIGHT)) {
        if (bits == 16) {
            return 0;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        }
    }
    return -1;
}


// First read and start the hw block
static void pdm_pcm_rx_init(machine_pdm_pcm_obj_t *self) {
    mplogger_print("pdm_pcm_rx_init \r\n");

    if (!self->pdm_pcm_initialized) {
        mp_raise_ValueError(MP_ERROR_TEXT("PDM_PCM not initialized"));
        return;
    }

    /* Set up pointers to two buffers to implement a ping-pong buffer system */
    memset(self->audio_buffer0, 0, FRAME_SIZE * sizeof(int16_t));
    memset(self->audio_buffer1, 0, FRAME_SIZE * sizeof(int16_t));
    self->active_rx_buffer = self->audio_buffer0;
    self->full_rx_buffer = self->audio_buffer1;
    self->have_data = false;
    self->init_discard_counter = 4; /* Skip the first 4 frames */

    /* Activate channels - CRITICAL STEP! */
    if ((self->format == MONO_LEFT) || (self->format == STEREO)) {
        Cy_PDM_PCM_Activate_Channel(PDM0, LEFT_CH_INDEX);
        mplogger_print("Activated left channel\r\n");
    }

    if ((self->format == MONO_RIGHT) || (self->format == STEREO)) {
        Cy_PDM_PCM_Activate_Channel(PDM0, RIGHT_CH_INDEX);
        mplogger_print("Activated right channel\r\n");
    }

    mplogger_print("PDM_PCM started successfully\r\n");
}

// IRQ Handler
static void pdm_pcm_irq_handler(void) {
    machine_pdm_pcm_obj_t *self = MP_STATE_PORT(machine_pdm_pcm_obj[0]);
    if (self == NULL) {
        return;
    }

    uint8_t num_channels = (self->format == STEREO) ? 2 : 1;

    /* Used to track how full the buffer is */
    static uint16_t frame_counter = 0;

    /* Check the interrupt status */
    uint32_t intr_status = Cy_PDM_PCM_Channel_GetInterruptStatusMasked(PDM0, channel_index);

