tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/machine_pdm_pcm.c
    if (intr_status & CY_PDM_PCM_INTR_RX_TRIGGER) {
        /* Move data from the PDM fifo and place it in a buffer */
        uint32_t index = 0;
        for (uint32_t i = 0; i < (RX_FIFO_DRAIN_WORDS / num_channels); i++) {
            if (self->format == STEREO) {
                int32_t data_left = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, LEFT_CH_INDEX);
                self->active_rx_buffer[frame_counter * RX_FIFO_DRAIN_WORDS + index] = (int16_t)(data_left);
                index++;
                int32_t data_right = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, RIGHT_CH_INDEX);
                self->active_rx_buffer[frame_counter * RX_FIFO_DRAIN_WORDS + index] = (int16_t)(data_right);
                index++;
            } else {
                int32_t data = (int32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, channel_index);
                self->active_rx_buffer[frame_counter * RX_FIFO_DRAIN_WORDS + index] = (int16_t)(data);
                index++;
            }
        }

        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, channel_index, CY_PDM_PCM_INTR_RX_TRIGGER);
        frame_counter++;
    }

    /* Check if the buffer is full */
    if (frame_counter >= NUMBER_INTERRUPTS_FOR_FRAME) {
        /* Flip the active and the next rx buffers */
        int16_t *temp = self->active_rx_buffer;
        self->active_rx_buffer = self->full_rx_buffer;
        self->full_rx_buffer = temp;

        /* Set the have_data flag as true, signaling there is data ready for use */
        if (self->init_discard_counter > 0) {
            self->init_discard_counter--;
            memset(self->full_rx_buffer, 0, FRAME_SIZE * sizeof(int16_t));
        } else {
            self->have_data = true;

            #if MICROPY_PY_MACHINE_PDM_PCM_RING_BUF
            // Copy data to ring buffer for both BLOCKING and NON_BLOCKING modes
            // This enables seamless switching between modes
            uint8_t *buf_p = (uint8_t *)self->full_rx_buffer;
            uint32_t buf_size = FRAME_SIZE * sizeof(int16_t);
            for (uint32_t i = 0; i < buf_size; i++) {
                ringbuf_put(&self->ring_buffer, buf_p[i]);
            }

            // For NON_BLOCKING mode, trigger callback processing
            if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
                fill_appbuf_from_ringbuf_non_blocking(self);
            }
            #else // MICROPY_PY_MACHINE_PDM_PCM_RING_BUF
            // Call user callback if registered (for BLOCKING mode without ringbuf)
            if (self->callback_for_non_blocking != mp_const_none && self->callback_for_non_blocking != MP_OBJ_NULL) {
                mp_sched_schedule(self->callback_for_non_blocking, MP_OBJ_FROM_PTR(self));
            }
            #endif // MICROPY_PY_MACHINE_PDM_PCM_RING_BUF
        }
        frame_counter = 0;
    }

    /* Handle overflow/underflow errors */
    if (intr_status & (CY_PDM_PCM_INTR_RX_FIR_OVERFLOW | CY_PDM_PCM_INTR_RX_OVERFLOW |
                       CY_PDM_PCM_INTR_RX_IF_OVERFLOW | CY_PDM_PCM_INTR_RX_UNDERFLOW)) {
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, channel_index, CY_PDM_PCM_INTR_MASK);
    }
}

// Configure PDM_PCM IRQ
static void pdm_pcm_irq_configure(machine_pdm_pcm_obj_t *self) {
    mplogger_print("pdm_pcm_irq_configure \r\n");

    cy_stc_sysint_t irq_cfg = {
        .intrSrc = self->irq_num,
        .intrPriority = PDM_PCM_ISR_PRIORITY
    };

    cy_rslt_t result = Cy_SysInt_Init(&irq_cfg, pdm_pcm_irq_handler);
    if (result != CY_SYSINT_SUCCESS) {
        mp_raise_msg_varg(&mp_type_ValueError,
            MP_ERROR_TEXT("PDM_PCM interrupt configuration failed with return code %lx !"), result);
    }

    NVIC_ClearPendingIRQ(irq_cfg.intrSrc);
    NVIC_EnableIRQ(irq_cfg.intrSrc);
}


// =======================================================================================
// MPY bindings for PDM_PCM

MP_NOINLINE static void machine_pdm_pcm_init_helper(machine_pdm_pcm_obj_t *self, size_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mplogger_print("machine_pdm_pcm_init_helper \r\n");
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_sck,             MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_data,            MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_sample_rate,     MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 16000} },
        { MP_QSTR_decimation_rate, MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 96} },
        { MP_QSTR_bits,            MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = 16} },
        { MP_QSTR_format,          MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = MONO_LEFT} },
        { MP_QSTR_left_gain,       MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_LEFT_GAIN} },
        { MP_QSTR_right_gain,      MP_ARG_KW_ONLY | MP_ARG_INT,   {.u_int = DEFAULT_RIGHT_GAIN} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    mp_machine_pdm_pcm_init_helper(self, args);
}

// PDM_PCM(...) Constructor
static mp_obj_t machine_pdm_pcm_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    mplogger_print("machine_pdm_pcm_make_new \r\n");
    mp_arg_check_num(n_pos_args, n_kw_args, 1, MP_OBJ_FUN_ARGS_MAX, true);
    mp_int_t pdm_pcm_id = mp_obj_get_int(args[0]);

    machine_pdm_pcm_obj_t *self = mp_machine_pdm_pcm_make_new_instance(pdm_pcm_id);

    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw_args, args + n_pos_args);
    machine_pdm_pcm_init_helper(self, n_pos_args - 1, args + 1, &kw_args);

    return MP_OBJ_FROM_PTR(self);
}

// constructor()
static machine_pdm_pcm_obj_t *mp_machine_pdm_pcm_make_new_instance(mp_int_t pdm_pcm_id) {
    mplogger_print("mp_machine_pdm_pcm_make_new_instance \r\n");
    (void)pdm_pcm_id;
    machine_pdm_pcm_obj_t *self = NULL;
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PDM_PCM; i++) {
        if (MP_STATE_PORT(machine_pdm_pcm_obj[i]) == NULL) {
            self = mp_obj_malloc(machine_pdm_pcm_obj_t, &machine_pdm_pcm_type);
            MP_STATE_PORT(machine_pdm_pcm_obj[i]) = self;
            self->pdm_pcm_id = i;
            break;
        }
    }
    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("all available pdm pcm instances are allocated"));
    }
    return self;
}

