tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/machine_pdm_pcm.c
// init.helper()
static void mp_machine_pdm_pcm_init_helper(machine_pdm_pcm_obj_t *self, mp_arg_val_t *args) {
    mplogger_print("mp_machine_pdm_pcm_init_helper \r\n");

    self->sck = mp_hal_get_pin_obj(args[ARG_sck].u_obj);
    self->data = mp_hal_get_pin_obj(args[ARG_data].u_obj);

    const mp_hal_pin_af_config_t pdm_pins_config[] = {
        MP_HAL_PIN_AF_CONF(self->sck, CY_GPIO_DM_STRONG_IN_OFF, 1, MACHINE_PIN_AF_SIGNAL_PDM_CLK),
        MP_HAL_PIN_AF_CONF(self->data, CY_GPIO_DM_HIGHZ, 1, MACHINE_PIN_AF_SIGNAL_PDM_DATA),
    };

    mp_hal_periph_pins_af_config(pdm_pins_config, 2);

    // Assign configurable parameters
    // PDM_PCM Mode
    format_t pdm_pcm_format = args[ARG_format].u_int;
    if ((pdm_pcm_format != MONO_LEFT) &&
        (pdm_pcm_format != MONO_RIGHT) &&
        (pdm_pcm_format != STEREO)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid format"));
    }
    self->format = pdm_pcm_format;

    // Check word length
    uint8_t pdm_pcm_word_length = args[ARG_bits].u_int;
    if (pdm_pcm_word_length < BITS_16 || pdm_pcm_word_length > BITS_24) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid word length"));
    }
    self->bits = args[ARG_bits].u_int;

    // Set gains
    self->left_gain = args[ARG_left_gain].u_int;
    self->right_gain = args[ARG_right_gain].u_int;

    // Set sampling and decimation rates (as given by user)
    self->sample_rate = args[ARG_sample_rate].u_int;

    if (self->sample_rate == 8000 ||
        self->sample_rate == 16000 ||
        self->sample_rate == 48000) {
        if (PLL0_freq != AUDIO_SYS_CLOCK_73_728_000_HZ) {
            mp_raise_ValueError(MP_ERROR_TEXT("Invalid clock frequency set for the sample rate/ PDM_PCM Clock not set . Set the right clock before initialising PDM_PCM"));
        }
    } else if (self->sample_rate == 22050 ||
               self->sample_rate == 44100) {
        if (PLL0_freq != AUDIO_SYS_CLOCK_169_344_000_HZ) {
            mp_raise_ValueError(MP_ERROR_TEXT("Invalid clock frequency set for the sample rate/ PDM_PCM Clock not set. Set the right clock before initialising PDM_PCM"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("rate not supported"));
    }

    self->decimation_rate = args[ARG_decimation_rate].u_int;
    if (self->decimation_rate < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid decimation rate"));
    }

    int32_t ring_buffer_len = 20000;
    if (ring_buffer_len < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid ibuf"));
    }
    self->ibuf = ring_buffer_len;
    self->callback_for_non_blocking = MP_OBJ_NULL;
    self->io_mode = BLOCKING;

    // Initialize buffer pointers
    self->active_rx_buffer = NULL;
    self->full_rx_buffer = NULL;
    self->have_data = false;
    self->pdm_pcm_initialized = false;
    self->init_discard_counter = 0;

    mplogger_print("PDM_PCM configured: sample_rate=%ld, decimation_rate=%d, bits=%u, format=%u, left_gain=%d, right_gain=%d\r\n",
        args[ARG_sample_rate].u_int,
        args[ARG_decimation_rate].u_int,
        args[ARG_bits].u_int,
        args[ARG_format].u_int,
        args[ARG_left_gain].u_int,
        args[ARG_right_gain].u_int);

    ringbuf_alloc(&self->ring_buffer, ring_buffer_len);
    pdm_pcm_init(self);
    pdm_pcm_irq_configure(self);
    /* Start the block here, not only in .init().
     *
     * Cy_PDM_PCM_Activate_Channel() lives in pdm_pcm_rx_init(), whose own
     * comment calls it the CRITICAL STEP, and until tonight the only caller was
     * the .init() method. A script that constructed PDM_PCM and called
     * readinto() -- which is what every audio example in this tree does, and
     * what the microphone was declared broken on -- never set the start bit.
     * Measured on an Eva Kit 2026-08-13: every PDM register read 0x00000000
     * before init, after init and after the failed read, and readinto() timed
     * out at 2 s on both channels. Nothing was wrong with the microphone; it
     * was never switched on.
     *
     * It also left active_rx_buffer and full_rx_buffer NULL, so .init() was
     * mandatory rather than optional -- which no docstring said and no example
     * did. Every other machine peripheral on this port is usable straight from
     * its constructor; this one now matches. Calling .init() again is still
     * safe: it re-arms the ping-pong buffers and re-activates an already
     * active channel. */
    pdm_pcm_rx_init(self);
}

// init()
static void mp_machine_pdm_pcm_init(machine_pdm_pcm_obj_t *self) {
    mplogger_print("mp_machine_pdm_pcm_init \r\n");
    pdm_pcm_rx_init(self);
}

// deinit()
static void mp_machine_pdm_pcm_deinit(machine_pdm_pcm_obj_t *self) {
    mplogger_print("mp_machine_pdm_pcm_deinit \r\n");

    if ((self->format == MONO_LEFT) || (self->format == STEREO)) {
        Cy_PDM_PCM_DeActivate_Channel(PDM0, LEFT_CH_INDEX);
    }
    if ((self->format == MONO_RIGHT) || (self->format == STEREO)) {
        Cy_PDM_PCM_DeActivate_Channel(PDM0, RIGHT_CH_INDEX);
    }
    MP_STATE_PORT(machine_pdm_pcm_obj[self->pdm_pcm_id]) = NULL;
}

// set_gain()
static void mp_machine_pdm_pcm_set_gain(machine_pdm_pcm_obj_t *self, int16_t left_gain, int16_t right_gain) {
    mplogger_print("mp_machine_pdm_pcm_set_gain \r\n");
    cy_rslt_t result = Cy_PDM_PCM_SetGain(PDM0, LEFT_CH_INDEX, left_gain);
    pdm_pcm_assert_raise_val("PDM_PCM set left channel gain failed with return code %lx !", result);
    result = Cy_PDM_PCM_SetGain(PDM0, RIGHT_CH_INDEX, right_gain);
    pdm_pcm_assert_raise_val("PDM_PCM set right channel gain failed with return code %lx !", result);

}

// irq update
static void mp_machine_pdm_pcm_irq_update(machine_pdm_pcm_obj_t *self) {
    (void)self;
}

// =======================================================================================
// Implementation for stream protocol
static mp_uint_t machine_pdm_pcm_stream_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    uint8_t appbuf_sample_size_in_bytes = (self->bits / 8) * (self->format == STEREO ? 2: 1);
    if (size % appbuf_sample_size_in_bytes != 0) { // size should be multiple of sample size
        *errcode = MP_EINVAL;
        return MP_STREAM_ERROR;
    }
    if (size == 0) {
        return 0;
    }

    if (self->io_mode == BLOCKING) {
        mp_buffer_info_t appbuf;
        appbuf.buf = (void *)buf_in;
        appbuf.len = size;
        #if MICROPY_PY_MACHINE_PDM_PCM_RING_BUF
        uint32_t num_bytes_read = fill_appbuf_from_ringbuf(self, &appbuf);
        #else
        // Blocking read from ping-pong buffers
        // Wait for data to be available
        while (!self->have_data) {
            __WFI();  // Wait for interrupt
        }

        // Calculate how many bytes to copy
        uint32_t buffer_size_bytes = FRAME_SIZE * sizeof(int16_t);
        uint32_t num_bytes_read = (size < buffer_size_bytes) ? size : buffer_size_bytes;

        // Copy data from full_rx_buffer to application buffer
        memcpy(buf_in, self->full_rx_buffer, num_bytes_read);

        // Clear the have_data flag
        self->have_data = false;
        #endif
        return num_bytes_read;
    } else {
        #if MICROPY_PY_MACHINE_PDM_PCM_RING_BUF
        self->non_blocking_descriptor.appbuf.buf = (void *)buf_in;
        self->non_blocking_descriptor.appbuf.len = size;
        self->non_blocking_descriptor.index = 0;
        self->non_blocking_descriptor.copy_in_progress = true;
        return size;
        #else
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Non-blocking mode requires ring buffer support"));
        return 0;
        #endif
    }
}

// PDM_PCM.pending() -> milliseconds of audio waiting in the ring buffer
//
// This number IS the delay. Whatever a program reads next is this old, because
// the ISR fills the ring at the far end and a reader takes the oldest bytes
// first. A loop that reads faster than 16 kHz keeps it near zero; a loop that
// stops to draw on the display between reads watches it climb until the ring is
// full, and from then on everything it shows is a fixed half-second late.
//
// Worth having as a measurement rather than an argument: "the meter lags" and
// "pending() says 500" are different kinds of statement, and only one of them
// can be checked.
static mp_obj_t machine_pdm_pcm_pending(mp_obj_t self_in) {
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint8_t sample_bytes = (self->bits / 8) * (self->format == STEREO ? 2 : 1);
    bool straight_copy = (self->format != STEREO && self->bits == 16);
    uint32_t ring_bytes_per_sample = straight_copy
        ? sample_bytes
        : PDM_PCM_RX_FRAME_SIZE_IN_BYTES;
    uint32_t samples = ringbuf_avail(&self->ring_buffer) / ring_bytes_per_sample;
    uint32_t rate = self->sample_rate ? self->sample_rate : 1;
    return mp_obj_new_int_from_uint(samples * 1000 / rate);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_pending_obj, machine_pdm_pcm_pending);

// PDM_PCM.stats(buf, fresh=True) -> (rms, peak, dc)
//
// One read and the whole loudness calculation, in C.
//
// The same numbers can be had from Python: readinto(buf), assemble each pair of
// bytes into a signed sample, average them, subtract that average, then take the
// peak and the root mean square. That is what the mic module used to do, and it
// cost 280 ms per call measured on an Eva Kit 2026-08-14 - a level meter could
// only refresh three times a second, so a short sound landed in the gap between
// two refreshes and never appeared at all. The audio itself is 16 ms of a 16 kHz
// stream; every millisecond beyond that is the interpreter walking a list.
//
// The average removed here is the average of THIS buffer, not one carried across
// buffers. The PDM front end leaves a large DC offset with the signal riding on
// top of it, and its CIC filter drifts, so a running average lags and the result
// reports the offset rather than the sound.
static mp_obj_t machine_pdm_pcm_stats(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_buf, ARG_fresh };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_buf,   MP_ARG_REQUIRED | MP_ARG_OBJ,  {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_fresh, MP_ARG_KW_ONLY | MP_ARG_BOOL,  {.u_bool = true} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    mp_obj_t self_in = pos_args[0];
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->bits != 16) {
        mp_raise_ValueError(MP_ERROR_TEXT("stats() needs bits=16"));
    }

    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_WRITE);

