tesaiot/tesaiot-pse84-devkit-sdk/micropython-psoc-edge-psoc-edge-main/ports/psoc-edge/machine_pdm_pcm.c
    // fresh=True throws away everything the ring buffer has been holding except
    // the most recent window. THIS is what a level meter was waiting for.
    //
    // The ISR fills the ring continuously and a reader takes the oldest bytes
    // first, so a program that reads slower than 16 kHz falls steadily further
    // behind - up to the ring's own 625 ms - and what it displays is not the
    // room now, it is the room half a second ago. That is the delay you can see
    // by clapping and counting. Dropping the backlog costs nothing (it is a
    // pointer walk) and the window that remains is the newest audio there is.
    //
    // fresh=False keeps every sample in order, for anyone recording rather than
    // metering. The default is the metering answer because that is what this
    // method is for; recording should use readinto().
    if (args[ARG_fresh].u_bool) {
        uint8_t appbuf_sample_size = (self->bits / 8) * (self->format == STEREO ? 2 : 1);
        bool straight_copy = (self->format != STEREO && self->bits == 16);
        // Mono 16-bit reads the ring byte for byte; every other format walks it
        // one 8-byte hardware frame at a time. Dropping has to respect whichever
        // granule applies, or the bytes that remain no longer line up as samples.
        uint32_t granule = straight_copy ? 2 : PDM_PCM_RX_FRAME_SIZE_IN_BYTES;
        uint32_t ring_bytes_needed = straight_copy
            ? bufinfo.len
            : bufinfo.len * (PDM_PCM_RX_FRAME_SIZE_IN_BYTES / appbuf_sample_size);
        uint32_t avail = ringbuf_avail(&self->ring_buffer);
        if (avail > ring_bytes_needed) {
            uint32_t drop = ((avail - ring_bytes_needed) / granule) * granule;
            while (drop--) {
                ringbuf_get(&self->ring_buffer);
            }
        }
    }

    // Filled to the brim, one short read after another, the way readinto() does
    // it. A single call comes back with only what the ring buffer happens to
    // hold, and a partial window is not a smaller measurement - it is a wrong
    // one, because the offset removed below is the average of the samples in
    // hand. Reading once gave a quiet room an rms of 9029 against the 27 it
    // reports when the window is full (Eva Kit, 2026-08-14).
    size_t nbytes = 0;
    while (nbytes < bufinfo.len) {
        int errcode = 0;
        mp_uint_t n = machine_pdm_pcm_stream_read(self_in, (uint8_t *)bufinfo.buf + nbytes,
            bufinfo.len - nbytes, &errcode);
        if (n == MP_STREAM_ERROR) {
            if (mp_is_nonblocking_error(errcode)) {
                break;
            }
            mp_raise_OSError(errcode);
        }
        if (n == 0) {
            break;
        }
        nbytes += n;
    }

    size_t count = nbytes / 2;
    mp_obj_t out[3];
    if (count == 0) {
        out[0] = MP_OBJ_NEW_SMALL_INT(0);
        out[1] = MP_OBJ_NEW_SMALL_INT(0);
        out[2] = MP_OBJ_NEW_SMALL_INT(0);
        return mp_obj_new_tuple(3, out);
    }

    // Bytes are combined by hand rather than cast to int16_t *: the caller hands
    // in any buffer object, and little-endian assembly here matches byte for byte
    // what the Python version produced, so the numbers in the course material
    // stay the numbers the board reports.
    const uint8_t *b = (const uint8_t *)bufinfo.buf;

    int32_t sum = 0;
    for (size_t i = 0; i < count; i++) {
        sum += (int16_t)((uint16_t)b[2 * i] | ((uint16_t)b[2 * i + 1] << 8));
    }
    int32_t dc = sum / (int32_t)count;

    uint32_t peak = 0;
    uint64_t acc = 0;
    for (size_t i = 0; i < count; i++) {
        int32_t v = (int16_t)((uint16_t)b[2 * i] | ((uint16_t)b[2 * i + 1] << 8)) - dc;
        uint32_t a = (v < 0) ? (uint32_t)(-v) : (uint32_t)v;
        if (a > peak) {
            peak = a;
        }
        acc += (uint64_t)a * (uint64_t)a;
    }

    uint32_t mean_square = (uint32_t)(acc / count);
    uint32_t rms = mean_square;
    if (rms > 0) {
        uint32_t x = rms;
        uint32_t y = (x + 1) / 2;
        while (y < x) {
            x = y;
            y = (x + mean_square / x) / 2;
        }
        rms = x;
    }

    out[0] = mp_obj_new_int_from_uint(rms);
    out[1] = mp_obj_new_int_from_uint(peak);
    out[2] = mp_obj_new_int(dc);
    return mp_obj_new_tuple(3, out);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_pdm_pcm_stats_obj, 2, machine_pdm_pcm_stats);

static const mp_stream_p_t pdm_pcm_stream_p = {
    .read = machine_pdm_pcm_stream_read,
    .is_text = false,
};

static const mp_rom_map_elem_t machine_pdm_pcm_locals_dict_table[] = {
    // Methods
    { MP_ROM_QSTR(MP_QSTR_init),            MP_ROM_PTR(&machine_pdm_pcm_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit),          MP_ROM_PTR(&machine_pdm_pcm_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_readinto),        MP_ROM_PTR(&mp_stream_readinto_obj) },
    { MP_ROM_QSTR(MP_QSTR_stats),           MP_ROM_PTR(&machine_pdm_pcm_stats_obj) },
    { MP_ROM_QSTR(MP_QSTR_pending),         MP_ROM_PTR(&machine_pdm_pcm_pending_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_gain),        MP_ROM_PTR(&machine_pdm_pcm_set_gain_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq),             MP_ROM_PTR(&machine_pdm_pcm_irq_obj) },

    #if MICROPY_PY_MACHINE_PDM_PCM_FINALISER
    { MP_ROM_QSTR(MP_QSTR___del__),         MP_ROM_PTR(&machine_pdm_pcm_deinit_obj) },
    #endif

    // Constants
    // Word lengths
    { MP_ROM_QSTR(MP_QSTR_BITS_16),          MP_ROM_INT(BITS_16) },

    // Modes
    { MP_ROM_QSTR(MP_QSTR_STEREO),          MP_ROM_INT(STEREO) },
    { MP_ROM_QSTR(MP_QSTR_MONO_LEFT),       MP_ROM_INT(MONO_LEFT) },
    { MP_ROM_QSTR(MP_QSTR_MONO_RIGHT),      MP_ROM_INT(MONO_RIGHT) },
};
MP_DEFINE_CONST_DICT(machine_pdm_pcm_locals_dict, machine_pdm_pcm_locals_dict_table);

MP_REGISTER_ROOT_POINTER(struct _machine_pdm_pcm_obj_t *machine_pdm_pcm_obj[MICROPY_HW_MAX_PDM_PCM]);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_pdm_pcm_type,
    MP_QSTR_PDM_PCM,
    MP_TYPE_FLAG_ITER_IS_STREAM,
    make_new, machine_pdm_pcm_make_new,
    print, machine_pdm_pcm_print,
    protocol, &pdm_pcm_stream_p,
    locals_dict, &machine_pdm_pcm_locals_dict
    );

#endif // MICROPY_PY_MACHINE_PDM_PCM
